{
    "Adjustment": {
      "description": "Modifications or corrections made to an existing financial transaction or record, often to address discrepancies, update terms, or realign financial commitments.",
      "subcategories": {
        "Reallocation Fees": "Charges incurred for reallocating funds or assets between different accounts, tranches, or financial instruments within an agreement, often due to portfolio adjustments or strategy changes.",
        "Amendment Fees": "Fees charged for making changes or amendments to an agreement or contract, such as adjusting interest rates, repayment schedules, or covenant terms, which require administrative processing and approval.",
        "Reallocation Principal": "The principal amount that is reallocated between different allocations, tranches, or investment categories, usually within structured finance or syndicated loan agreements to optimize capital distribution."
      },
      "fields": ["deal_name", "amount", "transaction_date"]
    },
    "AU Transfer": {
      "description": "Transfers related to the allocation of loan principal amounts within structured loan agreements, particularly in commercial or syndicated lending. AU Transfers involve reallocation of principal across different tranches, projects, or lenders, ensuring proper fund distribution.",
      "subcategories": {
        "Cashless Roll": "A transaction where an existing loan position is rolled over to a new agreement without requiring an additional cash settlement, often used in refinancing or restructuring scenarios to maintain financial stability."
      },
      "fields": ["deal_name", "amount", "transaction_date"]
    },
    "Closing Notice": {
      "description": "Notification of the termination or closure of an account, loan facility, or financial agreement. Closing notices are issued to document the completion of financial obligations or changes in contractual terms.",
      "subcategories": {
        "Cashless Roll": "A loan restructuring technique that allows rolling over an existing debt without requiring an immediate cash payment, commonly used in refinancing or extending loan maturities."
      },
      "fields": ["deal_name", "transaction_date"]
    },
    "Commitment Change": {
      "description": "Alteration to an agreed obligation or pledge in a financial contract. Commitment changes occur when a borrower requests an increase or decrease in a credit facility, affecting available funds and potential interest costs.",
      "subcategories": {
        "Decrease": "Reduction in the committed loan amount or credit facility, often due to repayment, reduced financial needs, or changes in creditworthiness.",
        "Increase": "Addition to the committed loan amount, typically approved based on a borrower's financial standing and projected needs, leading to increased borrowing capacity."
      },
      "fields": ["deal_name", "amount", "transaction_date"]
    },
    "Fee Payment": {
      "description": "Disbursement of charges or dues for services, financial transactions, or loan management fees. These payments cover operational costs, interest, and administrative expenses associated with financial agreements.",
      "subcategories": {
        "Ongoing Fee": "Recurring charges for continuous services, such as maintenance fees, administration fees, or periodic financial management costs associated with a loan.",
        "Letter of Credit Fee": "Charges for issuing or maintaining a letter of credit, which guarantees a borrower's payment obligations and mitigates risk for lenders and counterparties."
      },
      "fields": ["deal_name", "amount", "transaction_date", "account_number"]
    },
    "Money Movement-Inbound": {
      "description": "Funds being received or deposited into an account, often from loan disbursements, customer payments, or investment inflows. Inbound money movement plays a crucial role in managing liquidity and financial planning.",
      "subcategories": {
        "Principal": "The original amount of a loan or investment that is deposited or received, excluding interest and additional fees, forming the base for financial transactions.",
        "Interest": "The cost of borrowing money or the return on investment, representing the amount earned or owed over time due to financing arrangements.",
        "Principal + Interest": "Combined payment of the original loan amount and the accrued interest, reflecting the total financial obligation due at a given time.",
        "Principal+Interest+Fee": "Total payment including the original loan amount, interest charges, and additional service or administrative fees, covering all financial components of a loan repayment."
      },
      "fields": ["deal_name", "amount", "transaction_date", "account_number"]
    },
    "Money Movement - Outbound": {
      "description": "Funds being sent or withdrawn from an account, often for loan repayments, vendor payments, or international transactions. Outbound money movements ensure financial obligations are met and capital is deployed effectively.",
      "subcategories": {
        "Timebound": "Transfer with specific time constraints, often due to contractual deadlines, maturity dates, or scheduled disbursements in financial agreements.",
        "Foreign Currency": "Transaction involving currencies other than the base currency, which may include currency exchange costs, forex risk management, and cross-border payment considerations."
      },
      "fields": ["deal_name", "amount", "transaction_date", "account_number"]
    }
  }